jmeter/dashboard/statistics.json
{
  "rider - ask for new order" : {
    "transaction" : "rider - ask for new order",
    "sampleCount" : 35,
    "errorCount" : 0,
    "errorPct" : 0.0,
    "meanResTime" : 8.942857142857145,
    "medianResTime" : 7.0,
    "minResTime" : 6.0,
    "maxResTime" : 31.0,
    "pct1ResTime" : 13.0,
    "pct2ResTime" : 29.39999999999999,
    "pct3ResTime" : 31.0,
    "throughput" : 4.30822255046775,
    "receivedKBytesPerSec" : 3.5004308222550464,
    "sentKBytesPerSec" : 1.4388790158788773
  },
  "rider - get current order" : {
    "transaction" : "rider - get current order",
    "sampleCount" : 69,
    "errorCount" : 0,
    "errorPct" : 0.0,
    "meanResTime" : 4.536231884057969,
    "medianResTime" : 4.0,
    "minResTime" : 3.0,
    "maxResTime" : 11.0,
    "pct1ResTime" : 7.0,
    "pct2ResTime" : 8.0,
    "pct3ResTime" : 11.0,
    "throughput" : 8.570363929946591,
    "receivedKBytesPerSec" : 6.974580021115389,
    "sentKBytesPerSec" : 2.8958456247671096
  },
  "manager - get all stores' info" : {
    "transaction" : "manager - get all stores' info",
    "sampleCount" : 25,
    "errorCount" : 0,
    "errorPct" : 0.0,
    "meanResTime" : 4.12,
    "medianResTime" : 4.0,
    "minResTime" : 3.0,
    "maxResTime" : 7.0,
    "pct1ResTime" : 5.0,
    "pct2ResTime" : 6.399999999999999,
    "pct3ResTime" : 7.0,
    "throughput" : 8.719916288803628,
    "receivedKBytesPerSec" : 6.122675597314266,
    "sentKBytesPerSec" : 2.912315791768399
  },
  "rider - update order status" : {
    "transaction" : "rider - update order status",
    "sampleCount" : 69,
    "errorCount" : 0,
    "errorPct" : 0.0,
    "meanResTime" : 6.666666666666669,
    "medianResTime" : 6.0,
    "minResTime" : 5.0,
    "maxResTime" : 13.0,
    "pct1ResTime" : 9.0,
    "pct2ResTime" : 11.0,
    "pct3ResTime" : 13.0,
    "throughput" : 8.575689783743476,
    "receivedKBytesPerSec" : 4.103480184253045,
    "sentKBytesPerSec" : 3.601119733407905
  },
  "manager - get general statistics" : {
    "transaction" : "manager - get general statistics",
    "sampleCount" : 25,
    "errorCount" : 0,
    "errorPct" : 0.0,
    "meanResTime" : 5.039999999999999,
    "medianResTime" : 5.0,
    "minResTime" : 4.0,
    "maxResTime" : 9.0,
    "pct1ResTime" : 6.400000000000002,
    "pct2ResTime" : 8.399999999999999,
    "pct3ResTime" : 9.0,
    "throughput" : 8.726003490401396,
    "receivedKBytesPerSec" : 4.328915794066317,
    "sentKBytesPerSec" : 2.948434773123909
  },
  "manager - get riders' statistics" : {
    "transaction" : "manager - get riders' statistics",
    "sampleCount" : 25,
    "errorCount" : 0,
    "errorPct" : 0.0,
    "meanResTime" : 3.6,
    "medianResTime" : 3.0,
    "minResTime" : 2.0,
    "maxResTime" : 7.0,
    "pct1ResTime" : 4.400000000000002,
    "pct2ResTime" : 6.399999999999999,
    "pct3ResTime" : 7.0,
    "throughput" : 8.744316194473592,
    "receivedKBytesPerSec" : 4.320921869534803,
    "sentKBytesPerSec" : 2.9717012067156348
  },
  "manager - login" : {
    "transaction" : "manager - login",
    "sampleCount" : 25,
    "errorCount" : 0,
    "errorPct" : 0.0,
    "meanResTime" : 91.44,
    "medianResTime" : 88.0,
    "minResTime" : 84.0,
    "maxResTime" : 132.0,
    "pct1ResTime" : 111.60000000000001,
    "pct2ResTime" : 126.6,
    "pct3ResTime" : 132.0,
    "throughput" : 8.434547908232119,
    "receivedKBytesPerSec" : 5.675198739035088,
    "sentKBytesPerSec" : 2.0345052083333335
  },
  "rider - login" : {
    "transaction" : "rider - login",
    "sampleCount" : 70,
    "errorCount" : 0,
    "errorPct" : 0.0,
    "meanResTime" : 88.5285714285714,
    "medianResTime" : 86.0,
    "minResTime" : 81.0,
    "maxResTime" : 202.0,
    "pct1ResTime" : 90.0,
    "pct2ResTime" : 92.45,
    "pct3ResTime" : 202.0,
    "throughput" : 7.773459189339256,
    "receivedKBytesPerSec" : 5.207610355358134,
    "sentKBytesPerSec" : 1.8674521099389227
  },
  "rider - get all their orders" : {
    "transaction" : "rider - get all their orders",
    "sampleCount" : 70,
    "errorCount" : 0,
    "errorPct" : 0.0,
    "meanResTime" : 10.428571428571432,
    "medianResTime" : 10.0,
    "minResTime" : 7.0,
    "maxResTime" : 24.0,
    "pct1ResTime" : 13.0,
    "pct2ResTime" : 16.450000000000003,
    "pct3ResTime" : 24.0,
    "throughput" : 8.54283622162558,
    "receivedKBytesPerSec" : 34.821353658164504,
    "sentKBytesPerSec" : 2.828145975713937
  },
  "Total" : {
    "transaction" : "Total",
    "sampleCount" : 578,
    "errorCount" : 0,
    "errorPct" : 0.0,
    "meanResTime" : 23.461937716262987,
    "medianResTime" : 7.0,
    "minResTime" : 2.0,
    "maxResTime" : 249.0,
    "pct1ResTime" : 86.10000000000002,
    "pct2ResTime" : 89.0,
    "pct3ResTime" : 180.67000000000098,
    "throughput" : 38.81278538812785,
    "receivedKBytesPerSec" : 39.47399138379667,
    "sentKBytesPerSec" : 13.870636814229117
  },
  "rider - get reviews statistics" : {
    "transaction" : "rider - get reviews statistics",
    "sampleCount" : 70,
    "errorCount" : 0,
    "errorPct" : 0.0,
    "meanResTime" : 3.3000000000000003,
    "medianResTime" : 3.0,
    "minResTime" : 2.0,
    "maxResTime" : 8.0,
    "pct1ResTime" : 5.0,
    "pct2ResTime" : 5.450000000000003,
    "pct3ResTime" : 8.0,
    "throughput" : 8.565834557023983,
    "receivedKBytesPerSec" : 4.03196509422418,
    "sentKBytesPerSec" : 2.894315192119432
  },
  "manager - get all riders info" : {
    "transaction" : "manager - get all riders info",
    "sampleCount" : 25,
    "errorCount" : 0,
    "errorPct" : 0.0,
    "meanResTime" : 6.840000000000001,
    "medianResTime" : 6.0,
    "minResTime" : 5.0,
    "maxResTime" : 18.0,
    "pct1ResTime" : 7.400000000000002,
    "pct2ResTime" : 14.999999999999993,
    "pct3ResTime" : 18.0,
    "throughput" : 8.677542519958347,
    "receivedKBytesPerSec" : 5.092971732905242,
    "sentKBytesPerSec" : 2.9320602655328014
  },
  "client/store - make a purchase" : {
    "transaction" : "client/store - make a purchase",
    "sampleCount" : 70,
    "errorCount" : 0,
    "errorPct" : 0.0,
    "meanResTime" : 36.30000000000001,
    "medianResTime" : 17.0,
    "minResTime" : 10.0,
    "maxResTime" : 249.0,
    "pct1ResTime" : 89.69999999999993,
    "pct2ResTime" : 234.70000000000007,
    "pct3ResTime" : 249.0,
    "throughput" : 24.339360222531294,
    "receivedKBytesPerSec" : 10.871558262343534,
    "sentKBytesPerSec" : 13.619583405771905
  }
}